app/controllers/api/benches_controller.rb

    def create
        @bench = Bench.new(bench_params)
        if @bench.save
---
INSERT INTO "benches" ("title", "description", "price", "seating", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def show
        @bench = Bench.find_by(id: params[:id])
---
SELECT "benches".* FROM "benches" WHERE "benches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]